Tekla Open API Reference for Tekla Structures 2025
IDataType Interface
 The IDataType interface is the root interface for converting all the Tekla.Structures.Datatype.* types to basic types supported by the Tekla Structures Object Dialog tree.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IDataType
Public Interface IDataType
See Also
Reference
Tekla.Structures.Datatype Namespace